
A = [
    [1, 2, 3, 4, 5, 6],
    [7, 8, 9, 10, 11, 12],
    [13, 14, 15, 16, 17, 18],
    [19, 20, 21, 22, 23, 24],
    [25, 26, 27, 28, 29, 30],
    [31, 32, 33, 34, 35, 36]
]


m = A[0][0]
i_max = 0

for i in range(6):
    if A[i][i] > m:
        m = A[i][i]
        i_max = i

print("Максимальный элемент на главной диагонали:", m)
print("Индекс строки с максимальным элементом:", i_max)


for i in range(i_max):
    for j in range(i + 1, 6):  
        A[i][j] = 0

print("Измененная матрица:")
for r in A:
    print(r)
